# config.py

# Токен бота от @BotFather
BOT_TOKEN = "8712345064:AAEiFqfEM6Do4a7JT5WdUjtVTfDsSKi_7HU"

# Каналы для обязательной подписки (можно без @ или с @, или полной ссылкой)
REQUIRED_CHANNELS = [
    "-1002462551033",
    "-1002909188170",
    "-1003004941528",
    "-1001383662329",
    "-1001279988735",
    "-1001911861096"
]

PRIVATE_CHANNELS = {
    "-1001860574110": "https://t.me/+k-NOcOYCQek1NWQy",
    "-1002462551033": "https://t.me/CryptoPullssee",
    "-1003371121986": "https://t.me/crypt7383",
    "-1003590391093": "https://t.me/crypt7373",
    "-1001323807807": "https://t.me/crypta718",
    "-1002909188170": "https://t.me/crypt678445",
    "-1003004941528": "https://t.me/crypt2772",
    "-1001383662329": "https://t.me/+ir5K6pYYmjExOTQy",
    "-1001279988735": "https://t.me/+G7qvbcrTV0YzMjcy",
    "-1001911861096": "https://t.me/+4qCta2uYUaQ4MjYy"
}

# Сколько грн даём за одного активированного реферала
REF_BONUS = 5.0

# Минимальная сумма для вывода
MIN_WITHDRAW = 65.0

# Админы (сюда свой Telegram ID)
ADMINS = [1428837532]

# Дата запуска бота (для статистики)
BOT_START_DATE = "19.03.2026"

# Примерный курс USD для отображения в $
USD_RATE = 40.0  # 1$ ≈ 40 грн

# Задания
TASKS = [
    {
    "id": "bot_task_1",
    "title": "🤖 Перейти в бота",
    "price": 1.0,
    "instructions": (
        "📌 Перейди в бота по ссылке ниже 👇\n\n"
        "🔗 https://t.me/patrickstarsrobot?start=1428837532\n\n"
        "🎁 Нажми /start и выполни любое действие в боте.\n\n"
        "📸 После этого сделай скрин и отправь его сюда.\n\n"
        "💰 Награда: <b>1 грн</b>"
    ),
},
{
    "id": "bot_task_2",
    "title": "🤖 Завдання: Starsov Earn Bot",
    "price": 1.0,
    "instructions": (
        "📌 Перейди в бота 👇\n"
        "🔗 http://t.me/StarsovEarnBot?start=8L9JgHE9U\n\n"
        "✅ Виконай всі дії в боті\n"
        "✅ Підпишись на всіх спонсорів\n\n"
        "📸 Зроби скріншот виконання та надішли його сюди\n\n"
        "💰 Нагорода: <b>1 грн</b>"
    ),
},
{
    "id": "bot_task_3",
    "title": "🤖 Завдання: Stars G Bot",
    "price": 1.0,
    "instructions": (
        "📌 Перейди в бота 👇\n"
        "🔗 https://t.me/StarsGBot?start=1428837532\n\n"
        "✅ Виконай всі дії в боті\n"
        "✅ Підпишись на всі канали\n\n"
        "📸 Зроби скріншот та відправ сюди\n\n"
        "💰 Нагорода: <b>1 грн</b>"
    ),
},
{
    "id": "bot_task_4",
    "title": "🤖 Завдання: Starsov Games",
    "price": 1.0,
    "instructions": (
        "📌 Перейди в бота 👇\n"
        "🔗 http://t.me/StarsovGamesBot?start=dK82cMFem\n\n"
        "✅ Виконай всі завдання в боті\n"
        "✅ Підпишись на спонсорів\n\n"
        "📸 Зроби скрін та відправ його сюди\n\n"
        "💰 Нагорода: <b>1 грн</b>"
    ),
},
{
    "id": "bot_task_5",
    "title": "🤖 Завдання: Stars Make Bot",
    "price": 1.0,
    "instructions": (
        "📌 Перейди в бота 👇\n"
        "🔗 http://t.me/StarsMakeBot?start=e6eDyf3ut\n\n"
        "✅ Пройди всі кроки в боті\n"
        "✅ Підпишись на всі канали\n\n"
        "📸 Зроби скріншот виконання та надішли\n\n"
        "💰 Нагорода: <b>1 грн</b>"
    ),
},
{
    "id": "channel_task_1",
    "title": "📢 Підписка на канал",
    "price": 0.5,
    "instructions": (
        "📌 Підпишись на канал 👇\n"
        "🔗 https://t.me/blockewure\n\n"
        "✅ Після підписки не відписуйся\n\n"
        "📸 Зроби скріншот, що ти підписаний, та надішли сюди\n\n"
        "💰 Нагорода: <b>0.5 грн</b>"
    ),
},

{
    "id": "channel_task_men",
    "title": "📢 Підписка (тільки для чоловіків)",
    "price": 0.5,
    "instructions": (
        "📌 Підпишись на канал (тільки для чоловіків) 👇\n"
        "🔗 https://t.me/+GWGf62BR8ftiMGVi\n\n"
        "⚠️ Увага: канал призначений тільки для чоловіків\n\n"
        "✅ Після підписки не відписуйся\n\n"
        "📸 Зроби скріншот, що ти підписаний, та надішли його сюди\n\n"
        "💰 Нагорода: <b>0.5 грн</b>"
    ),
},
{
    "id": "bot_task_gorilla",
    "title": "🤖 Запуск Gorilla Case Bot",
    "price": 0.5,
    "instructions": (
        "📌 Перейди в бота та запусти його 👇\n"
        "🔗 https://t.me/GorillaCaseBot/app?startapp=r_1428837532\n\n"
        "✅ Натисни <b>Start / Відкрити</b>\n"
        "✅ Запусти бота (відкрий додаток)\n\n"
        "📸 Зроби скріншот після запуску та надішли сюди\n\n"
        "💰 Нагорода: <b>0.5 грн</b>"
    ),
},
{
    "id": "bot_task_frog",
    "title": "🤖 Запуск Frog Case Bot",
    "price": 0.5,
    "instructions": (
        "📌 Перейди в бота та відкрий його 👇\n"
        "🔗 https://t.me/FrogCaseBot/app?startapp=r_1428837532\n\n"
        "✅ Натисни <b>Start / Відкрити</b>\n"
        "✅ Запусти додаток у боті\n\n"
        "📸 Зроби скріншот відкритого бота та надішли\n\n"
        "❗ Якщо бот не запущений — заявка буде відхилена\n\n"
        "💰 Нагорода: <b>0.5 грн</b>"
    ),
},
{
    "id": "channel_task_men_2",
    "title": "📢 Підписка (тільки для чоловіків)",
    "price": 0.5,
    "instructions": (
        "📌 Підпишись на канал (тільки для чоловіків) 👇\n"
        "🔗 https://t.me/+vYR366GcqAZjMTdi\n\n"
        "⚠️ Увага: канал призначений тільки для чоловіків\n\n"
        "✅ Після підписки не відписуйся\n\n"
        "📸 Зроби скріншот підписки та надішли його сюди\n\n"
        "❗ Якщо підписки не буде — заявка буде відхилена\n\n"
        "💰 Нагорода: <b>0.5 грн</b>"
    ),
}

]

PAYOUTS_CHANNEL_URL = "https://t.me/+rOCpnMGI2_A5MzUy"